{"name":"Tabitha Trubey","headerTaglineOne":"Hello World! 👋","headerTaglineTwo":"I'm Tabitha Trubey - Full Stack Developer,","headerTaglineThree":"Marine Corps Veteran,","headerTaglineFour":"and self-proclaimed coffee con·nois·seur!","showCursor":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/tabithatrubey"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/tabitha-trubey"},{"id":"3","title":"Email","link":"mailto:tabithatrubey@outlook.com"}],"projects":[{"id":"1","title":"Color Palette with React","description":"Web Design","imageSrc":"https://images.unsplash.com/photo-1504083898675-c896ecdae86e?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjJ8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://github.com/tabithatrubey/color-palette/settings/pages"},{"id":"2","title":"Tic-Tac-Toe","description":"Web Development","imageSrc":"https://images.unsplash.com/photo-1605153864431-a2795a1b2f95?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxjb2xsZWN0aW9uLXBhZ2V8MXwyNTY3ODl8fGVufDB8fHw%3D&auto=format&fit=crop&w=400&q=60","url":"http://chetanverma.com/"},{"id":"3","title":"Treasure Hunt","description":"Design","imageSrc":"https://images.unsplash.com/photo-1504083898675-c896ecdae86e?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjJ8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"http://chetanverma.com/"}],"services":[{"id":"1","title":"Front-End","description":"Helps create visually appealing and performant products with HTML/CSS/JavaScript with a focus on user experience."},{"id":"2","title":"Back-End","description":"Helps construct and maintain the architecture that controls the logic, security, and communication between a website's database and a user's browser."},{"id":"3","title":"Full-Stack","description":"Combines creative styling with technical functionality to deploy striking multiple-page applications. Develops both client and server-side softwares."},{"id":"4","title":"Analysis","description":"Identifies the vulnerabilities and gaps that need to be fixed or patched to reduce the possibility of exploitation and unauthorized user access."}],"aboutpara":"Hi, my name is Tabitha Trubey, but I typically go by Tabi. I served as a Cyber Intelligence Analyst in the United States Marine Corps, and had the luxury to work alongside expert analysts, experienced technicians., and beautiful brains. I made a career jump to pursue my passion for problem solving in software development. I feel most passionate when I can identify a problem, maintain the tools and knowledge to fix it independently or via pair programming, and generating immediate impacts.","resume":{"tagline":"👋  I'm a Full Stack Developer with an active TS/SCI and CI poly!","description":"I'm well-versed with React, Javascript, Ruby, Ruby on Rails, PostgreSQL, Jest/RSpec, Git, HTML, and CSS.","experiences":[{"id":"1","dates":"2022 - 2023","type":"LEARN academy","position":"Full Stack Developer","bullets":"Completed 640 hours of collaborative hands-on curriculum in HTML/CSS/ JavaScript/React/Ruby/Ruby on Rails/PostgreSQL/Jest/RSpec., Created and deployed multiple-page applications via Ruby on Rails/React frameworks and proper APIs to encompass full stack development, Employed trouble-shooting methods to successfully test dynamic code funtionality/edge cases and resolved web application issues to ensure 100% functionality."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"2017 - 2022","type":"USCYBERCOM","position":"Cyber Intelligence Analyst","bullets":"Produced and published Cyber Intelligence Reports to inform Marine Corps leadership and the greater Intelligence Community regarding vulnerabilities and exposures that affected highly sensitive portions of MCEN assets to properly mitigate/ prevent data loss/patch issues., Directed teams of experienced civilian and military personnel to develop an understanding of significant threats and vulnerabilities to the MCEN which informed the Commanding General's contractual decision and also contributed to an ongoing law enforcement investigation."}],"education":{"universityName":"University of Maryland Global Campus","universityDate":"2019-2022","universityPara":"B.S. in Computer Networks and Cybersecurity with a minor in Homeland Security. Graduated with Honors: Magna Cum Laude (GPA: 3.9/4.0). Inducted into a National Honor Society Fraternity: Alpha Sigma Lambda"}}}